package 파석6;

public class Time extends Thread {
    static int time;
    static int sec;
    static int day = 1; //하루를 1분으로 설정
    /*public static int time() {
        return time;
    }
    public static int day() {
        return day;
    }*/

    @Override
    public void run() {
        int minute = 0;

        while (true) {
            //60으로 바꾸기
            minute++;
            sec = minute % 60;
            time = minute / 60 % 60;

            if (time == 0 && sec == 1) {
                System.out.println();
                System.out.println("지금은 [낮🌝]입니다.");
                System.out.println("        .\n" +
                                   "      \\ | /\n" +
                                   "    '-.;;;.-'\n" +
                                   "   -==;;;;;==-\n" +
                                   "    .-';;;'-.\n" +
                                   "      / | \\\n" +
                                   "jgs     '");
                System.out.println(" 아침 해가 밝았습니다 ");
                System.out.println();
            }

            else if (time == 1 && sec== 0) {
                System.out.println();
                System.out.println("지금은 [밤🌚]입니다. ");
                System.out.println("         _.._\n" +
                                   "       .' .-'`\n" +
                                   "      /  /\n" +
                                   "      |  |\n" +
                                   "      \\  \\\n" +
                                   "jgs    '._'-._\n" +
                                   "          ```");
                System.out.println("몬스터들이 달빛의 정기를 받아 평소보다 강해집니다");
                System.out.println();
            }

            else if (time == 2) {
                minute = 0;
                day++;
                System.out.println();
                System.out.println("      ※주의※ " + day + "일이 되었습니다 ※주의※");
                System.out.println("❗❗❗   ※주의※ " + day + "일이 되었습니다 ※주의※   ❗❗❗");
                System.out.println("      ※주의※ " + day + "일이 되었습니다 ※주의※");
                System.out.println();
            }

            else if (day == 10){
                System.out.println("제한시간에 클리어하지 못하여 게임이 종료 됩니다 ");
                System.exit(0);
            }


            //System.out.println(time + ":" + sec);

            //예외처리
            try {
                sleep(1000);
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
        }
    }

    public void win(){
        if(day == 4 && time > 0){
            System.out.println("축하드립니다");
            System.out.println("                _..---.._\n" +
                               "               .' .-'''-. '.\n" +
                               "              / .'  _..._'. \\\n" +
                               "       __    : :  /`;'   ) : :          _,=\"`\\\n" +
                               " ,--''`  ``'.; : |;   ,-;  : ;  __..==\"\"==.,_|\n" +
                               "  `-,        `; .\\;  / ^\\ _,.=\"//\n" +
                               "     '-,_.--._ '.(;_.'__/`_.-'`\\\n" +
                               ",.--''`` _..=. `'--.//   ``      \\\n" +
                               "`--,   '`      `-  |_\\ '-.       |\n" +
                               "    `-._         _.;--`-..___,.-'`\n" +
                               "        `'-...-_:',;`==,| \\\n" +
                               "          _.--',=\" /   /\"=;=\"=,\n" +
                               "       _.'  ,=\".-'`  .'  /| ,=\"\n" +
                               "  _.--' .-' \"=,     :  .' | \",\n" +
                               "  `;._ .--'.'    .-' .' . ;\n" +
                               "  ,;;\\_ .   '._.'--'` -' /\n" +
                               "    ,;;;._  '-._ .''.__.'\n" +
                               "         `\\_  .' '._   /\n" +
                               "            '._      .(`\n" +
                               "        jgs   '._ ';./\n" +
                               "                 `;`");

        }

        else if(day == 0 && time > 0){
            System.out.println("축하드립니다");
            System.out.println("                _..---.._\n" +
                               "               .' .-'''-. '.\n" +
                               "              / .'  _..._'. \\\n" +
                               "       __    : :  /`;'   ) : :          _,=\"`\\\n" +
                               " ,--''`  ``'.; : |;   ,-;  : ;  __..==\"\"==.,_|\n" +
                               "  `-,        `; .\\;  / ^\\ _,.=\"//\n" +
                               "     '-,_.--._ '.(;_.'__/`_.-'`\\\n" +
                               ",.--''`` _..=. `'--.//   ``      \\\n" +
                               "`--,   '`      `-  |_\\ '-.       |\n" +
                               "    `-._         _.;--`-..___,.-'`\n" +
                               "        `'-...-_:',;`==,| \\\n" +
                               "          _.--',=\" /   /\"=;=\"=,\n" +
                               "       _.'  ,=\".-'`  .'  /| ,=\"\n" +
                               "  _.--' .-' \"=,     :  .' | \",\n" +
                               "  `;._ .--'.'    .-' .' . ;\n" +
                               "  ,;;\\_ .   '._.'--'` -' /\n" +
                               "    ,;;;._  '-._ .''.__.'\n" +
                               "         `\\_  .' '._   /\n" +
                               "            '._      .(`\n" +
                               "        jgs   '._ ';./\n" +
                               "                 `;`");

        }

        else if(day == 5 && time > 0){
            System.out.println("축하드립니다");
            System.out.println("                _..---.._\n" +
                               "               .' .-'''-. '.\n" +
                               "              / .'  _..._'. \\\n" +
                               "       __    : :  /`;'   ) : :          _,=\"`\\\n" +
                               " ,--''`  ``'.; : |;   ,-;  : ;  __..==\"\"==.,_|\n" +
                               "  `-,        `; .\\;  / ^\\ _,.=\"//\n" +
                               "     '-,_.--._ '.(;_.'__/`_.-'`\\\n" +
                               ",.--''`` _..=. `'--.//   ``      \\\n" +
                               "`--,   '`      `-  |_\\ '-.       |\n" +
                               "    `-._         _.;--`-..___,.-'`\n" +
                               "        `'-...-_:',;`==,| \\\n" +
                               "          _.--',=\" /   /\"=;=\"=,\n" +
                               "       _.'  ,=\".-'`  .'  /| ,=\"\n" +
                               "  _.--' .-' \"=,     :  .' | \",\n" +
                               "  `;._ .--'.'    .-' .' . ;\n" +
                               "  ,;;\\_ .   '._.'--'` -' /\n" +
                               "    ,;;;._  '-._ .''.__.'\n" +
                               "         `\\_  .' '._   /\n" +
                               "            '._      .(`\n" +
                               "        jgs   '._ ';./\n" +
                               "                 `;`");

        }

        else if(day == 6 && time  > 0){
            System.out.println("       ___                  ____                  ___\n" +
                               "  ____(   \\              .-'    `-.              /   )____\n" +
                               " (____     \\_____       /  (O  O)  \\       _____/     ____)\n" +
                               "(____            `-----(      )     )-----'            ____)\n" +
                               " (____     _____________\\  .____.  /_____________     ____)\n" +
                               "   (______/              `-.____.-'              \\______)");

        }

        else if(day == 7 && time  > 0){
            System.out.println(".　　　　　 /j⌒i\n" +
                               "　　　　 ./　 !\n" +
                               "　　　　/　 /_＿,,..\n" +
                               "　　　/　　`(_t＿,__〕\n" +
                               "　　 /　　　 ‘(_t＿__〕\n" +
                               "　　/　　　｛_i＿__〕\n" +
                               "／　　　 ノ　 {_i＿_〉\n" +
                               "　　　　　　＿,..-’”\n" +
                               "＿人人人人＿\n" +
                               "＞최고에요＜\n" +
                               "￣Y^Y^Y^Y￣\n");

        }

        else if(day == 8 && time  > 0){
            System.out.println("｡ﾟﾟ･｡･ﾟﾟ｡\n" +
                               "ﾟ。 축　｡ﾟ\n" +
                               "　ﾟ･｡･ﾟ\n" +
                               "　｡ﾟﾟ･｡･ﾟﾟ｡\n" +
                               "　ﾟ。 하　｡ﾟ\n" +
                               "　　ﾟ･｡･ﾟ\n" +
                               "｡ﾟﾟ･｡･ﾟﾟ｡\n" +
                               "ﾟ。 해　｡ﾟ\n" +
                               "　ﾟ･｡･ﾟ\n");

        }

        else if(day == 9 && time  > 0){
            System.out.println("조금만 늦었으면 ... 위험했겠는걸,...");
            System.out.println(".⠀⠀⠀⠰⡿⠿⠛⠛⠻⠿⣷\n" +
                               "⠀⠀⠀⠀⠀⠀⣀⣄⡀⠀⠀⠀⠀⢀⣀⣀⣤⣄⣀⡀\n" +
                               "⠀⠀⠀⠀⠀⢸⣿⣿⣷⠀⠀⠀⠀⠛⠛⣿⣿⣿⡛⠿⠷\n" +
                               "⠀⠀⠀⠀⠀⠘⠿⠿⠋⠀⠀⠀⠀⠀⠀⣿⣿⣿⠇\n" +
                               "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠁\n" +
                               "⠀⠀⠀⠀⣿⣷⣄⠀⢶⣶⣷⣶⣶⣤⣀\n" +
                               "⠀⠀⠀⠀⣿⣿⣿⠀⠀⠀⠀⠀⠈⠙⠻⠗\n" +
                               "⠀⠀⠀⣰⣿⣿⣿⠀⠀⠀⠀⢀⣀⣠⣤⣴⣶⡄\n" +
                               "⠀⣠⣾⣿⣿⣿⣥⣶⣶⣿⣿⣿⣿⣿⠿⠿⠛⠃\n" +
                               "⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄\n" +
                               "⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡁\n" +
                               "⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁\n" +
                               "⠀⠀⠛⢿⣿⣿⣿⣿⣿⣿⡿⠟\n" +
                               "⠀⠀⠀⠀⠀⠉⠉⠉\n");

        }
    }
}